++++ running Little Lisp
Welcome to Little Lisp.
> (quote)
quote given 0 args, but needs 1 args
()
> (quote a)
a
> (quote 8)
8
> (quote (a))
(a)
> (quote ())
()
> (quote (quote a))
(quote a)
> scan: token too long -- truncated to nosuchfuncti
(nosuchfuncti 8)
"nosuchfuncti" is not bound as a function
()
> (noway)
"noway" is not bound as a function
()
> (list)
()
> (list ())
(())
> (list 1)
(1)
> (list 1 2)
(1 2)
> (list 1 2 3)
(1 2 3)
> (list 1 2 3 4)
(1 2 3 4)
> (list (quote a))
(a)
> (list (quote b) 1 2 (list 5 6) 3 (quote c))
(b 1 2 (5 6) 3 c)
> (list (quote (((((())))))))
((((((()))))))
> (list (list (list (list (list (list (list 4)))))))
(((((((4)))))))
> (nope)
"nope" is not bound as a function
()
> 
Bye.
++++ done running Little Lisp
