++++ running Little Lisp
Welcome to Little Lisp.
> (listp)
listp given 0 args, but needs 1 args
()
> (listp 8)
()
> (listp (quote bb))
()
> (listp (quote (a b c)))
-999
> (listp ())
-999
> (atom)
atom given 0 args, but needs 1 args
()
> (atom 8)
-999
> (atom (quote bb))
-999
> (atom (quote (a b c)))
()
> (atom ())
-999
> (null ())
-999
> (null (quote bb))
()
> (null (quote (a)))
()
> (null 88)
()
> (integerp 3)
-999
> (integerp (quote bb))
()
> (integerp (quote (a)))
()
> (integerp ())
()
> (integerp (quote ()))
()
> ((show))
bad cons'ed object as function/lambda
()
> ((quote 8))
bad cons'ed object as function/lambda
()
> (())
null car in eval
()
> 
Bye.
++++ done running Little Lisp
